-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2026-09-16 05:22:03
-- サーバのバージョン： 10.4.32-MariaDB
-- PHP のバージョン: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `kyokugen`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `chara_id` int(11) NOT NULL,
  `カテゴリ` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `categories`
--

INSERT INTO `categories` (`id`, `chara_id`, `カテゴリ`) VALUES
(1, 1, '復活戦士'),
(2, 2, '�����T�C���l'),
(3, 3, 'ナメック星編'),
(4, 4, 'ナメック星編'),
(5, 5, '劇場版BOSS'),
(6, 6, '未来編'),
(7, 7, '魔人ブウ編'),
(8, 8, 'ナメック星人'),
(9, 9, '純粋サイヤ人'),
(10, 10, '神次元'),
(11, 11, '超サイヤ人3'),
(12, 12, 'フュージョン'),
(13, 13, '劇場版HERO'),
(14, 14, '劇場版BOSS'),
(15, 15, 'ベジータの系譜'),
(16, 16, '孫悟空の系譜'),
(17, 17, ''),
(18, 18, '少年・少女'),
(19, 19, '神次元'),
(20, 20, '最凶の一族'),
(21, 21, '孫悟空の系譜'),
(22, 22, 'ナメック星人'),
(23, 23, 'ポタラ'),
(24, 24, '�����T�C���l'),
(25, 25, 'ギニュー特戦隊'),
(26, 26, '未来編'),
(27, 27, '人造人間/セル編'),
(28, 28, '第6宇宙'),
(29, 29, 'かめはめ波'),
(30, 30, '変身強化'),
(31, 31, '好敵手'),
(32, 32, '超サイヤ人2'),
(33, 33, '時空を超えし者'),
(34, 34, '指定の絆'),
(35, 35, '怒り爆発'),
(36, 36, 'ベジータの系譜'),
(37, 37, '第7宇宙代表'),
(38, 38, '兄弟の絆'),
(39, 39, '宇宙サバイバル編'),
(40, 40, 'ドラゴンボールを求めし者'),
(41, 41, '純粋サイヤ人'),
(42, 42, 'リベンジ'),
(43, 43, '劇場版BOSS'),
(44, 44, 'フュージョン'),
(45, 45, 'フルパワー'),
(46, 46, '急激な成長'),
(47, 47, '宇宙サバイバル編'),
(48, 48, '人工生命体'),
(49, 49, '少年・少女'),
(50, 50, '�����T�C���l'),
(51, 51, 'つながる希望'),
(52, 52, '人工生命体'),
(53, 53, '超サイヤ人'),
(54, 54, '人造人間/セル編'),
(55, 55, '魔人の力'),
(56, 56, '伝説の存在'),
(57, 57, 'ピチピチギャル'),
(58, 58, '超サイヤ人2'),
(59, 59, '永遠の宿敵'),
(60, 60, '恐怖の征服'),
(61, 61, '大猿パワー'),
(62, 62, '力戦奮闘'),
(63, 63, 'クロスオーバー'),
(64, 64, '宇宙をわたる戦士'),
(65, 65, '人造人間'),
(66, 66, 'クロスオーバー'),
(67, 67, 'フュージョン'),
(68, 68, '天才戦士'),
(69, 69, '純粋サイヤ人'),
(70, 70, '邪悪龍編'),
(71, 71, '融合/合体戦士'),
(72, 72, '最後の切り札'),
(73, 73, '超サイヤ人を超えた力'),
(74, 74, '体得した進化'),
(75, 75, ''),
(76, 76, '下級戦士'),
(77, 77, '魔人ブウ編'),
(78, 78, '託された意志'),
(79, 79, '正義の味方'),
(80, 80, '未来編'),
(81, 81, '世界の混乱'),
(82, 82, '命運をかけた闘い'),
(83, 83, 'GT BOSS'),
(84, 84, '親友の絆'),
(85, 85, 'ピチピチギャル'),
(86, 86, 'フルパワー'),
(87, 87, 'ナメック星編'),
(88, 88, '再起する力'),
(89, 89, '怒り爆発'),
(90, 90, 'リベンジ'),
(91, 91, '語り継がれし者'),
(92, 92, '託された意志'),
(93, 93, '劇場版BOSS'),
(94, 94, '劇場版HERO'),
(95, 95, '神次元'),
(96, 96, '人造人間/セル編'),
(97, 97, 'かめはめ波'),
(98, 98, '怒り爆発'),
(99, 99, '変身強化'),
(100, 100, 'ポタラ'),
(101, 101, 'ターゲット孫悟空'),
(102, 102, '高速戦闘'),
(103, 103, '純粋サイヤ人'),
(104, 104, '神次元'),
(105, 105, '伝説の存在'),
(106, 106, '宇宙サバイバル編'),
(107, 107, '第7宇宙代表'),
(108, 108, '力の吸収'),
(109, 109, '惑星破壊'),
(110, 110, '願いの力'),
(111, 111, 'GT HERO'),
(112, 112, '永遠の宿敵'),
(113, 113, 'ピチピチギャル'),
(114, 114, 'フルパワー'),
(115, 115, '時空を超えし者'),
(116, 116, '命運をかけた闘い'),
(117, 117, '人造人間'),
(118, 118, '未来編'),
(119, 119, '孫悟空の系譜'),
(120, 120, 'ベジータの系譜'),
(121, 121, '奇跡の覚醒'),
(122, 122, '地球育ちの戦士'),
(123, 123, '人造人間'),
(124, 124, '超サイヤ人'),
(125, 125, '復活戦士'),
(126, 126, '宇宙サバイバル編'),
(127, 127, '大会出場者'),
(128, 128, '劇場版HERO'),
(129, 129, '宇宙をわたる戦士'),
(130, 130, '最後の切り札'),
(131, 131, '人造人間/セル編'),
(132, 132, '神次元'),
(133, 133, '恐怖の征服'),
(134, 134, '天界の出来事'),
(135, 135, '人工生命体'),
(136, 136, '頭脳戦'),
(137, 137, '時間制限'),
(138, 138, '世界の混乱'),
(139, 139, 'コンビネーション'),
(140, 140, '変身強化'),
(141, 141, '第7宇宙代表'),
(142, 142, '奇跡の覚醒'),
(143, 143, '地球人'),
(144, 144, 'ピチピチギャル'),
(145, 145, '孫悟空の系譜'),
(146, 146, '地球育ちの戦士'),
(147, 147, '親子の絆'),
(148, 148, '人工生命体'),
(149, 149, 'つながる希望'),
(150, 150, 'ドラゴンボールを求めし者'),
(151, 151, '劇場版BOSS'),
(152, 152, '最凶の一族'),
(153, 153, '託された意志'),
(154, 154, '高速戦闘'),
(155, 155, '魔人ブウ編'),
(156, 156, '純粋サイヤ人'),
(157, 157, '魔人の力'),
(158, 158, 'ナメック星編'),
(159, 159, '超BOSS'),
(160, 160, '悪逆非道'),
(161, 161, '命運をかけた闘い'),
(162, 162, '最凶の一族'),
(163, 163, '力の吸収'),
(164, 164, '恐怖の征服'),
(165, 165, '人造人間/セル編'),
(166, 166, 'あの世の戦士'),
(167, 167, '第7宇宙代表'),
(168, 168, '高速戦闘'),
(169, 169, 'ナメック星編'),
(170, 170, 'サイヤ人編'),
(171, 171, '未来編');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `chara_id` (`chara_id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=172;

--
-- ダンプしたテーブルの制約
--

--
-- テーブルの制約 `categories`
--
ALTER TABLE `categories`
  ADD CONSTRAINT `categories_ibfk_1` FOREIGN KEY (`chara_id`) REFERENCES `characters` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
